Revit 2024 API
StructuralElementDefinitionData.StartShortening Property
 Cutback or extension at element curve start.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double StartShortening { get; }
Visual Basic
Public ReadOnly Property StartShortening As Double
	Get
Visual C++
public:
property double StartShortening {
	double get ();
}
See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace